In [1]:
import pandas as pd
import numpy as np

# Module: Pandas Assignments
## Lesson: Pandas
### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.

In [2]:
df1 = pd.DataFrame(np.random.randint(1,18,(6,4)),columns=['A','B','C','D'])

In [3]:
df1

    A   B   C   D
0  14  13  11  14
1   3   4  16  14
2   7   3  16  15
3  16  17   6   8
4   8   1   5   6
5   5   2   7  17

In [4]:
df1.set_index('A',inplace=True)

In [5]:
df1

     B   C   D
A
14  13  11  14
3    4  16  14
7    3  16  15
16  17   6   8
8    1   5   6
5    2   7  17

2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [24]:
columns = ['A','B','C']
index = ['X','Y','Z']
df2 = pd.DataFrame(np.random.randint(1,20,(3,3)),columns=columns,index=index)

In [25]:
df2

    A   B   C
X   5   7   9
Y  18   2  10
Z  14  11  14

In [26]:
df2.loc['Y','B']

np.int32(2)

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.

In [16]:
df2 = pd.DataFrame(np.random.randint(1,20,(5,3)),columns=['A','B','C'])

In [17]:
df2

    A   B   C
0  18   3  16
1  16   4  11
2  11  13  11
3   2   5   3
4   1   4   2

In [18]:
df2['AxB'] = df2['A'] * df2['B']

In [19]:
df2

    A   B   C  AxB
0  18   3  16   54
1  16   4  11   64
2  11  13  11  143
3   2   5   3   10
4   1   4   2    4

2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [20]:
df3 = pd.DataFrame(np.random.randint(1,20,(4,3)),columns=['A','B','C'])

In [21]:
df3

    A   B   C
0   9   8  16
1  14  16   4
2  12  18  15
3   2  11   5

In [36]:
print(f"column wise sum : ",df3.sum(axis=0)) # in this function it will operate along the rows(first 1st row element , then 2nd row element and so on) i.e axis = 0 is for rows only 
print(f"row wise sum : ",df3.sum(axis=1))  # in this function it will operate along the columns i.e axis = 1 is for columns only

column wise sum :  A    37
B    53
C    40
dtype: int64
row wise sum :  0    33
1    34
2    45
3    18
dtype: int64

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.

In [47]:
df4 = pd.DataFrame(np.random.randint(1,20,(5,3)),columns=['A','B','C'])

In [48]:
df4

    A   B   C
0   4  15  19
1  18   5   5
2  19  15   5
3   8   8  14
4   2   8  14

In [49]:
df4.iloc[1,2] = np.nan
df4.loc[2,'B'] = np.nan
df4.iloc[3,0] = np.nan

In [50]:
df4

      A     B     C
0   4.0  15.0  19.0
1  18.0   5.0   NaN
2  19.0   NaN   5.0
3   NaN   8.0  14.0
4   2.0   8.0  14.0

In [51]:
df4.isnull()

       A      B      C
0  False  False  False
1  False  False   True
2  False   True  False
3   True  False  False
4  False  False  False

In [53]:
df4.mean(axis=0)

A    10.75
B     9.00
C    13.00
dtype: float64

In [57]:
df4.fillna(df4.mean(),inplace=True)

In [58]:
df4

       A     B     C
0   4.00  15.0  19.0
1  18.00   5.0  13.0
2  19.00   9.0   5.0
3  10.75   8.0  14.0
4   2.00   8.0  14.0

2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [59]:
df5 = pd.DataFrame(np.random.randint(1,20,(6,4)),columns=['A','B','C','D'])

In [60]:
df5

    A   B   C   D
0  14  15  15   2
1   7   9  16  15
2  15   4  14   1
3  18   1  18   3
4  16   8   2  10
5   8  12  10   4

In [66]:
df5.loc[1,'A'] = np.nan

In [67]:
df5

      A   B   C   D
0  14.0  15  15   2
1   NaN   9  16  15
2  15.0   4  14   1
3  18.0   1  18   3
4  16.0   8   2  10
5   8.0  12  10   4

In [70]:
df5.isna()

       A      B      C      D
0  False  False  False  False
1   True  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False

In [75]:
df5.dropna(axis=0,inplace=True)

In [76]:
df5

      A   B   C   D
0  14.0  15  15   2
2  15.0   4  14   1
3  18.0   1  18   3
4  16.0   8   2  10
5   8.0  12  10   4

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.

In [88]:
data = {
    'Category':np.random.choice(['A', 'B', 'C'],size=10),
    'Values':np.random.randint(1,100,size=10)
}

In [89]:
df6 = pd.DataFrame(data)

In [90]:
df6

  Category  Values
0        A      63
1        A      48
2        A      16
3        C      93
4        B      19
5        B      69
6        A      49
7        C      36
8        C      74
9        B      49

In [91]:
df6.groupby('Category')['Values'].agg(['sum','mean'])

          sum       mean
Category
A         176  44.000000
B         137  45.666667
C         203  67.666667

2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [92]:
df7 = pd.DataFrame({'Product': np.random.choice(['Prod1', 'Prod2', 'Prod3'], size=10), 'Category': np.random.choice(['A', 'B', 'C'], size=10), 'Sales': np.random.randint(1, 100, size=10)})

In [93]:
df7

  Product Category  Sales
0   Prod1        C     26
1   Prod2        A     24
2   Prod3        B     13
3   Prod3        B     76
4   Prod3        A     18
5   Prod3        C     75
6   Prod1        A     41
7   Prod1        A     50
8   Prod2        B     90
9   Prod1        B      8

In [94]:
df7.groupby('Category')['Sales'].sum()

Category
A    133
B    187
C    101
Name: Sales, dtype: int32

### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.

In [108]:
df8 = pd.DataFrame({'Key': ['A', 'B', 'C', 'D'], 'Value1': np.random.randint(1, 100, size=4)})
df9 = pd.DataFrame({'Key': ['A', 'B', 'C', 'E'], 'Value2': np.random.randint(1, 100, size=4)})

In [109]:
df8

  Key  Value1
0   A      91
1   B      43
2   C      27
3   D      68

In [110]:
df9

  Key  Value2
0   A      79
1   B       9
2   C      41
3   E      67

In [115]:
df8.merge(df9,on='Key')

  Key  Value1  Value2
0   A      91      79
1   B      43       9
2   C      27      41

2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

In [116]:
df10 = pd.DataFrame({'A': np.random.randint(1, 100, size=3), 'B': np.random.randint(1, 100, size=3)})
df11 = pd.DataFrame({'C': np.random.randint(1, 100, size=3), 'D': np.random.randint(1, 100, size=3)})

In [117]:
df10

    A   B
0  93  35
1  69  63
2  89  11

In [118]:
df11

    C   D
0  66  22
1   7  67
2  62   8

In [120]:
pd.concat([df10,df11])

      A     B     C     D
0  93.0  35.0   NaN   NaN
1  69.0  63.0   NaN   NaN
2  89.0  11.0   NaN   NaN
0   NaN   NaN  66.0  22.0
1   NaN   NaN   7.0  67.0
2   NaN   NaN  62.0   8.0

### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.

In [134]:
date_rng = pd.date_range(start='2022-01-01', end='2022-12-31', freq='D')
df13 = pd.DataFrame(date_rng, columns=['date'])
df13['data'] = np.random.randint(1,1000,size=365)
df13.set_index('date',inplace=True)

In [135]:
df13.resample('ME').mean()

                  data
date
2022-01-31  483.806452
2022-02-28  456.714286
2022-03-31  498.225806
2022-04-30  629.700000
2022-05-31  598.935484
2022-06-30  513.733333
2022-07-31  505.645161
2022-08-31  488.806452
2022-09-30  465.933333
2022-10-31  470.258065
2022-11-30  416.500000
2022-12-31  438.967742

2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

In [139]:
date_rng = pd.date_range(start='2021-01-01',end='2021-12-31')

In [140]:
date_rng

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10',
               ...
               '2021-12-22', '2021-12-23', '2021-12-24', '2021-12-25',
               '2021-12-26', '2021-12-27', '2021-12-28', '2021-12-29',
               '2021-12-30', '2021-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [142]:
data = np.random.randint(1,1000,size=len(date_rng))

In [155]:
df14 = pd.DataFrame({'Dates':date_rng,'Values':data})

In [157]:
df14.set_index('Dates',inplace=True)

In [158]:
df14

            Values
Dates
2021-01-01     476
2021-01-02     583
2021-01-03     963
2021-01-04     883
2021-01-05     296
...            ...
2021-12-27     515
2021-12-28     438
2021-12-29     931
2021-12-30     560
2021-12-31     969

[365 rows x 1 columns]

In [159]:
df14.rolling(window=7).mean()

                Values
Dates
2021-01-01         NaN
2021-01-02         NaN
2021-01-03         NaN
2021-01-04         NaN
2021-01-05         NaN
...                ...
2021-12-27  562.714286
2021-12-28  529.857143
2021-12-29  595.000000
2021-12-30  549.285714
2021-12-31  580.714286

[365 rows x 1 columns]

### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.

In [161]:
arrays = [['A', 'A', 'B', 'B'], ['one', 'two', 'one', 'two']]
arrays

[['A', 'A', 'B', 'B'], ['one', 'two', 'one', 'two']]

In [162]:
index = pd.MultiIndex.from_arrays(arrays, names=('Category', 'SubCategory'))
index

MultiIndex([('A', 'one'),
            ('A', 'two'),
            ('B', 'one'),
            ('B', 'two')],
           names=['Category', 'SubCategory'])

In [163]:
df15 = pd.DataFrame(np.random.randint(1, 100, size=(4, 3)), index=index, columns=['Value1', 'Value2', 'Value3'])
df15

                      Value1  Value2  Value3
Category SubCategory
A        one              38      54      12
         two              56      51      12
B        one              28      34      97
         two              38      99      65

In [165]:
print(df15.loc['A'])

             Value1  Value2  Value3
SubCategory
one              38      54      12
two              56      51      12

In [166]:
print(df15.loc[('B', 'two')])

Value1    38
Value2    99
Value3    65
Name: (B, two), dtype: int32

2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

In [3]:
import pandas as pd
main_idx = ['vcd','vcd','vcd','vcd','dcd','dcd','dcd','dcd','mcd','mcd','mcd','mcd','cmd','cmd','cmd','cmd']
sub_index = ['high','low','medium','avg']
# sub_index = sub_index * 4
print(main_idx)
print(sub_index)

['vcd', 'vcd', 'vcd', 'vcd', 'dcd', 'dcd', 'dcd', 'dcd', 'mcd', 'mcd', 'mcd', 'mcd', 'cmd', 'cmd', 'cmd', 'cmd']
['high', 'low', 'medium', 'avg']

In [4]:
final_idx = [main_idx,sub_index*4]

In [5]:
final_idx

[['vcd',
  'vcd',
  'vcd',
  'vcd',
  'dcd',
  'dcd',
  'dcd',
  'dcd',
  'mcd',
  'mcd',
  'mcd',
  'mcd',
  'cmd',
  'cmd',
  'cmd',
  'cmd'],
 ['high',
  'low',
  'medium',
  'avg',
  'high',
  'low',
  'medium',
  'avg',
  'high',
  'low',
  'medium',
  'avg',
  'high',
  'low',
  'medium',
  'avg']]

In [6]:
index = pd.MultiIndex.from_arrays(final_idx,names=('Category','Sub-Category'))

In [14]:
index

MultiIndex([('vcd',   'high'),
            ('vcd',    'low'),
            ('vcd', 'medium'),
            ('vcd',    'avg'),
            ('dcd',   'high'),
            ('dcd',    'low'),
            ('dcd', 'medium'),
            ('dcd',    'avg'),
            ('mcd',   'high'),
            ('mcd',    'low'),
            ('mcd', 'medium'),
            ('mcd',    'avg'),
            ('cmd',   'high'),
            ('cmd',    'low'),
            ('cmd', 'medium'),
            ('cmd',    'avg')],
           names=['Category', 'Sub-Category'])

In [9]:
import numpy as np
df17 = pd.DataFrame(index=index,data=np.random.randint(1,100,(16,4)),columns=['P1','P2','P3','P4'])

In [10]:
df17

                       P1  P2  P3  P4
Category Sub-Category
vcd      high          50  14  62  54
         low           82  44  61  39
         medium        76  37  94  99
         avg           54  55  54  77
dcd      high          67  60   8  34
         low           71  63  15  36
         medium         2  58  35  43
         avg           75  55  93  94
mcd      high          61   2  51  99
         low           35  63  69  64
         medium        55  75  47  15
         avg            4  83  76  32
cmd      high          86  69  13  94
         low           44  67  74  89
         medium        97  77  63  46
         avg           14  45  29  61

In [32]:
high = df17.loc[(slice(None),'high'),:].sum(axis=1)
low = df17.loc[(slice(None),'low'),:].sum(axis=1)
medium = df17.loc[(slice(None),'medium'),:].sum(axis=1)
avg = df17.loc[(slice(None),'avg'),:].sum(axis=1)
print("high : ",high,"\n")
print("low : ",low,"\n")
print("medium : ",medium,"\n")
print("avg : ",avg,"\n")

high :  Category  Sub-Category
vcd       high            180
dcd       high            169
mcd       high            213
cmd       high            262
dtype: int64

low :  Category  Sub-Category
vcd       low             226
dcd       low             185
mcd       low             231
cmd       low             274
dtype: int64

medium :  Category  Sub-Category
vcd       medium          306
dcd       medium          138
mcd       medium          192
cmd       medium          283
dtype: int64

avg :  Category  Sub-Category
vcd       avg             240
dcd       avg             317
mcd       avg             195
cmd       avg             149
dtype: int64

In [33]:
arrays = [['A', 'A', 'B', 'B', 'C', 'C'], ['one', 'two', 'one', 'two', 'one', 'two']]

In [34]:
index = pd.MultiIndex.from_arrays(arrays,names=('Category','SubCategory'))

In [35]:
index

MultiIndex([('A', 'one'),
            ('A', 'two'),
            ('B', 'one'),
            ('B', 'two'),
            ('C', 'one'),
            ('C', 'two')],
           names=['Category', 'SubCategory'])

In [36]:
df = pd.DataFrame(np.random.randint(1,25,(6,3)),columns=['A','B','C'],index=index)

In [37]:
df

                       A   B   C
Category SubCategory
A        one          11  14  17
         two          22  16  12
B        one           2  20  10
         two           3  20   9
C        one          23  19   9
         two           7  23   9

In [43]:
one = df.loc[(slice(None),'one'),:].sum(axis=1)

In [44]:
one

Category  SubCategory
A         one            42
B         one            32
C         one            51
dtype: int64

In [45]:
two = df.loc[(slice(None),'two'),:].sum(axis=1)

In [46]:
two

Category  SubCategory
A         two            50
B         two            32
C         two            39
dtype: int64

### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.

In [71]:
date = pd.date_range(start='2024-08-09',end='2024-08-19')

In [72]:
date = np.random.choice(date,size=20)

In [73]:
date

array(['2024-08-11T00:00:00.000000000', '2024-08-11T00:00:00.000000000',
       '2024-08-09T00:00:00.000000000', '2024-08-12T00:00:00.000000000',
       '2024-08-10T00:00:00.000000000', '2024-08-18T00:00:00.000000000',
       '2024-08-19T00:00:00.000000000', '2024-08-16T00:00:00.000000000',
       '2024-08-19T00:00:00.000000000', '2024-08-14T00:00:00.000000000',
       '2024-08-19T00:00:00.000000000', '2024-08-10T00:00:00.000000000',
       '2024-08-16T00:00:00.000000000', '2024-08-19T00:00:00.000000000',
       '2024-08-18T00:00:00.000000000', '2024-08-17T00:00:00.000000000',
       '2024-08-17T00:00:00.000000000', '2024-08-13T00:00:00.000000000',
       '2024-08-19T00:00:00.000000000', '2024-08-18T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [74]:
Category = np.random.choice(['P1','P2','P3'],size=len(date))

In [75]:
Category

array(['P3', 'P2', 'P2', 'P3', 'P2', 'P2', 'P1', 'P3', 'P1', 'P2', 'P1',
       'P3', 'P1', 'P1', 'P2', 'P2', 'P1', 'P2', 'P3', 'P1'], dtype='<U2')

In [76]:
Value = np.random.randint(1,25,size = len(date))

In [77]:
Value

array([16, 18, 10, 21, 23,  1, 19,  7, 15, 24, 14, 11,  8,  7,  6, 23, 19,
       20,  9, 13], dtype=int32)

In [78]:
df_pivot = pd.DataFrame({'Date':date,'Category':Category,'Value':Value})
df_pivot.set_index
print(df_pivot)
pd.pivot_table(df_pivot,values='Value',index=['Date'],columns='Category',aggfunc='sum')

         Date Category  Value
0  2024-08-11       P3     16
1  2024-08-11       P2     18
2  2024-08-09       P2     10
3  2024-08-12       P3     21
4  2024-08-10       P2     23
5  2024-08-18       P2      1
6  2024-08-19       P1     19
7  2024-08-16       P3      7
8  2024-08-19       P1     15
9  2024-08-14       P2     24
10 2024-08-19       P1     14
11 2024-08-10       P3     11
12 2024-08-16       P1      8
13 2024-08-19       P1      7
14 2024-08-18       P2      6
15 2024-08-17       P2     23
16 2024-08-17       P1     19
17 2024-08-13       P2     20
18 2024-08-19       P3      9
19 2024-08-18       P1     13

Category      P1    P2    P3
Date
2024-08-09   NaN  10.0   NaN
2024-08-10   NaN  23.0  11.0
2024-08-11   NaN  18.0  16.0
2024-08-12   NaN   NaN  21.0
2024-08-13   NaN  20.0   NaN
2024-08-14   NaN  24.0   NaN
2024-08-16   8.0   NaN   7.0
2024-08-17  19.0  23.0   NaN
2024-08-18  13.0   7.0   NaN
2024-08-19  55.0   NaN   9.0

2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

In [79]:
df = pd.DataFrame({'Year': np.random.choice([2020, 2021, 2022], size=12), 'Quarter': np.random.choice(['Q1', 'Q2', 'Q3', 'Q4'], size=12), 'Revenue': np.random.randint(1, 1000, size=12)})

In [80]:
df

    Year Quarter  Revenue
0   2021      Q2      133
1   2021      Q2      518
2   2022      Q3      724
3   2021      Q2      491
4   2020      Q2      944
5   2022      Q2      391
6   2020      Q2      801
7   2020      Q4      920
8   2022      Q4      360
9   2021      Q2      908
10  2022      Q1      851
11  2021      Q1      533

In [81]:
pivot = pd.pivot_table(df,index='Year',columns='Quarter',aggfunc='sum',values='Revenue')

In [82]:
pivot

Quarter     Q1      Q2     Q3     Q4
Year
2020       NaN  1745.0    NaN  920.0
2021     533.0  2050.0    NaN    NaN
2022     851.0   391.0  724.0  360.0

### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.

In [83]:
df09 = pd.DataFrame(np.random.randint(1,20,(5,3)))

In [84]:
df09

    0  1   2
0   1  1   1
1  17  7  19
2   1  7   3
3  15  5   4
4  16  9   6

In [87]:
df09 = df09.map(lambda x : x**2)

In [88]:
df09

     0   1    2
0    1   1    1
1  289  49  361
2    1  49    9
3  225  25   16
4  256  81   36

2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

In [106]:
df09 = pd.DataFrame(np.random.randint(1,100,(6,3)))

In [107]:
df09

    0   1   2
0  37   4  22
1  51  31  43
2  71  85  20
3  87  69  82
4  20  98  47
5  49  88  12

In [108]:
df09['all_sum'] = df09.sum(axis=1)

In [109]:
df09

    0   1   2  all_sum
0  37   4  22       63
1  51  31  43      125
2  71  85  20      176
3  87  69  82      238
4  20  98  47      165
5  49  88  12      149

### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.

In [138]:
df_text = pd.DataFrame(np.random.choice(['vcd','cmd','mcd','dcd','vishal','dhwamni','jinu','pramod','rita'],size=5),columns=['Names'])

In [139]:
df_text

    Names
0  pramod
1     cmd
2  vishal
3  pramod
4     cmd

In [140]:
new_data = df_text.loc[:,'Names'].apply(lambda x : x.upper())

In [141]:
new_data

0    PRAMOD
1       CMD
2    VISHAL
3    PRAMOD
4       CMD
Name: Names, dtype: object

2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

In [143]:
series = pd.Series(np.random.choice(['vcd','cmd','mcd','dcd','vishal','dhwamni','jinu','pramod','rita'],size=5))

In [144]:
series

0    dhwamni
1        vcd
2        mcd
3    dhwamni
4       rita
dtype: object

In [152]:
extracted_data = series.str[:3]

In [153]:
extracted_data

0    dhw
1    vcd
2    mcd
3    dhw
4    rit
dtype: object